Tekla.Structures.Analysis.AnalysisModelHandler
The AnalysisModelHandler class contains information related to analysis models.
using Tekla.Structures.Analysis;
public class Class
{
public void Example()
{
Analysis Analysis = new Analysis();
AnalysisObjectSelector AnalysisObjectSelector = Analysis.GetAnalysisObjectSelector();
AnalysisObjectEnumerator AnalysisObjectEnumerator = AnalysisObjectSelector.GetAllObjectsWithType(AnalysisObject.AnalysisObjectEnum.ANALYSIS_MODEL, "");
while(AnalysisObjectEnumerator.MoveNext())
{
AnalysisModel AnalysisModel = AnalysisObjectEnumerator.Current as AnalysisModel;
if(AnalysisModel == null) continue;
}
}
}

Tekla.Structures.Analysis.AnalysisModelHandler.GetActiveModel
Gets the active model.
Returns: The active model.

Tekla.Structures.Analysis.AnalysisModelHandler.SetActiveModel(Tekla.Structures.Analysis.AnalysisModel)
Sets the active model.
The AnalysisModelName or ID has to be set.
AnalysisModel: The analysis model to be used.

Tekla.Structures.Analysis.AnalysisModelHandler.AddPart(Tekla.Structures.Analysis.AnalysisModel,Tekla.Structures.Model.Part)
Adds a part to the analysis model.
The ConstructionMethod must be SELECTED_PARTS, SELECTED_PARTS_AND_LOADS or FLOOR_BY_SELECTED_PARTS_AND_LOADS.
AnalysisModel: The analysis model to be used.
ModelPart: The model part to be used.

Tekla.Structures.Analysis.AnalysisModelHandler.RemovePart(Tekla.Structures.Analysis.AnalysisModel,Tekla.Structures.Model.Part)
Removes a part from the analysis model.
The ConstructionMethod must be SELECTED_PARTS, SELECTED_PARTS_AND_LOADS or FLOOR_BY_SELECTED_PARTS_AND_LOADS.
AnalysisModel: The analysis model to be used.
ModelPart: The model part to be used.

Tekla.Structures.Analysis.AnalysisModelHandler.AddLoad(Tekla.Structures.Analysis.AnalysisModel,Tekla.Structures.Model.Load)
Adds a load to the analysis model.
The ConstructionMethod must be SELECTED_PARTS, SELECTED_PARTS_AND_LOADS or FLOOR_BY_SELECTED_PARTS_AND_LOADS.
AnalysisModel: The analysis model to be used.
ModelLoad: The model load to be used.

Tekla.Structures.Analysis.AnalysisModelHandler.RemoveLoad(Tekla.Structures.Analysis.AnalysisModel,Tekla.Structures.Model.Load)
Removes a load from the analysis model.
The ConstructionMethod must be SELECTED_PARTS, SELECTED_PARTS_AND_LOADS or FLOOR_BY_SELECTED_PARTS_AND_LOADS.
AnalysisModel: The analysis model to be used.
ModelLoad: The model load to be used.

Tekla.Structures.Analysis.AnalysisModelHandler.SetActiveAnalysisModel(Tekla.Structures.Analysis.AnalysisModel)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.AnalysisModelHandler.GetActiveAnalysisModel
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.AnalysisModelHandler.DoModelObjectOperation(Tekla.Structures.Analysis.AnalysisModel,Tekla.Structures.Model.ModelObject,Tekla.Structures.Analysis.AnalysisModelHandler.ModelObjectOperationEnum)
DO NOT USE! For internal usage only!